// pages/my/log/log.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    logData:[
      {
        time:'Dec 27 2021',
        version:'v1.0.10',
        content:[
          '1.新增free-animation，加载动画',
          '2.free-drawer抽屉新增背景色',
          '3.优化free-tabs，多tabs切换更流畅，新增参数传递',
          '4.优化free-modal，新增内部关闭',
          '5.优化free-empty，无说明不显示',
          '6.优化free-messageTips，新增top位置'
        ]
      },
      {
        time:'Nov 22 2021',
        version:'v1.0.10',
        content:[
          '1.新增文本超链接，自定义颜色、跳转地址。',
          '2.修复全局图标异常大小问题' 
        ]
      },
      {
        time:'Sep 15 2021',
        version:'v1.0.8',
        content:[
          '1.free-input新增height字段',
          '2.新增作者联系方式',
          '3.更换布局样式',
        ]
      },
      {
        time:'Aug 31 2021',
        version:'v1.0.8',
        content:[
          '1.新增扩展之营销抽奖。包括刮刮乐、老虎机、跑马灯以及九宫格翻牌。',
          '2.新增扩展之海报生成。包括同步异步生成，自定义样式。',
          '3.新增更新弹窗,更新公告',
          '4.为提升首屏加载速度，进行了分包处理。'
          
        ]
      },
      {
        time:'Jult 30 2021', 
        version:'v1.0.7',
        content:[
          '1.free-input新增聚焦focus、max最大字数字段',
          '2.free-empty图片初始大小更改300rpx',
          '3.free-list新增noBorder，不设置底部边框',
          '4.free-backTop更改初始图标',
          '5.free-loading新增noBorder，不设置左右横线',
          '6.free-tabbar圆角限制',
          '7.free-judgeLogin新增跳转地址自定义',
        ]
      },
      {
        time:'Jult 13 2021',
        version:'v1.0.6',
        content:[
          '1.最近在刷算法和学习vue3，没来得及更新，现在恢复正常',
          '2.有需要的组件可以关注公众号【搞文艺的猿】，给我留言',
          '3.新增扩展组件【滑动解锁】'
        ]
      },
      {
        time:'June 1 2021',
        version:'v1.0.5',
        content:[
          '1.新增模板之奈雪小程序',
          '2.新增组件【提示引导】',
          '3.新增扩展【水印】',
          '3.新增扩展【底部分享】',
          '4.新增js工具库：时间格式化、多久之前、多久之后、防抖节流、颜色转化、规则验证、去除空格',
          '4.修复组件bug，新增组件class属性',
        ]
      },
      {
        time:'May 27 2021',
        version:'v1.0.4',
        content:[
          '1.新增模板之奈雪小程序',
          '2.新增组件【提示引导】',
          '3.新增扩展【水印】',
          '4.修复组件bug，新增组件class属性',
        ]
      },
      {
        time:'May 20 2021',
        version:'v1.0.3',
        content:[
          '1.新增索引列表，分城市索引、通讯录吸顶等',
          '2.新增分类选择扩展页面',
          '3.新增收货地址扩展页面',
          '4.新增登录扩展页面',
          '5.新增订单列表扩展页面',
          '6.新增订单详情扩展页面',
          '7.新增登录判断扩展组件',
          '8.新增操作条扩展组件',
          '9.新增操作条扩展组件',
          '10.新增占位槽、空内容简单组件',
        ]
      },
      {
        time:'May 14 2021',
        version:'v1.0.2',
        content:[
          '1.新增项目',
          '2.新增图标、色彩、布局',
          '3.下拉菜单、计数器、输入框、布局、图片模块页面重构',
          '4.下拉菜单、消息提示、弹窗、评分重构',
          '5.新增drawer抽屉',
          '6.开始重构所有页面，效果展示',
          '7.新增分段器模块',
          '8.新增列表模块',
          '9.新增滑动菜单模块',
          '10.新增卡片模块',
          '11.新增表单模块',
        ]
      },
      {
        time:'May 7 2021',
        version:'v0.1.1',
        content:[
          '1.新增城市选择模块',
          '2.新增通讯录模块',
          '3.新增吸顶模块',
          '4.新增返回顶部模块',
          '5.新增动作面板模块',
          '6.新增加载模块',
          '7.新增进度条模块',
          '8.新增时间轴模块',
          '9.新增页脚模块',
          '10.新增标题模块',
          '11.新增轮播模块',
          '12.新增通告模块',
          '13.新增折叠面板模块',
          '14.新增标签栏模块',
          '15.新增步骤条模块'
        ]
      },
      {
        time:'Apr 25 2021',
        version:'v1.0.0',
        content:[
          '1.新增图标模块',
          '2.新增颜色模块',
          '3.新增布局模块',
          '4.新增基础按钮样式',
          '5.新增tag标签模块',
          '6.新增文本样式模块',
          '7.新增列表模块',
          '8.新增图片模块',
          '9.新增标签页模块',
          '10.新增导航栏模块',
          '11.新增navbar模块',
          '12.新增弹窗模块',
          '13.新增tabs模块',
          '14.新增输入input模块',
          '15.新增步进器模块'
        ]
      },
    ],
    scrollTop:0
  },
  //页面滚动执行方式
  onPageScroll(e) {
    this.setData({
      scrollTop: e.scrollTop
    })
  },
  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})